#Effectively global namespaces that are used within the app

#TMDB Modes
MODES = {'s':'/search', 'd':'/discover'}
FORMATS = {'m':'/movie', 't':'/tv', 'a':'/actor'}

"""Reserved keys that will apply to every page on the app"""
UNIVERSAL_CONTROLS = {'q':[exit], 'Q':[exit]}

TELEVISION = """___________
|  _______  |
| |       | |
| |       | |
| |       | |
| |_______| |
|  (o) (o)  |
|___________|"""

CINEMA = """ øoOoOooø
ooøOøOoOoo
||||||||||
||||||||||
||||||||||
||||||||||
||||||||||
⌞||||||||⌟"""

ACTOR = """    _______   
   |       |  
 __|_______|__
   / .   . \  
   w  / \  w  
   \ ##### /  
  __\  ^  /__ 
 |   \_V_/   |"""


INTRO_TITLE = """                                        ▄▄                     ▄▄          
███▀▀██▀▀███████▀   ▀███▀   ▀███▀▀▀██▄  ██        ▀███       ▀███          
█▀   ██   ▀█ ▀██     ▄█       ██   ▀██▄             ██         ██          
     ██       ██▄   ▄█        ██   ▄██▀███  ▄██▀██  ██  ▄██▀   ██   ▄▄█▀██ 
     ██        ██▄  █▀        ███████   ██ ██▀  ██  ██ ▄█      ██  ▄█▀   ██
     ██        ▀██ █▀         ██        ██ ██       ██▄██      ██  ██▀▀▀▀▀▀
     ██         ▄██▄          ██        ██ ██▄    ▄ ██ ▀██▄    ██  ██▄    ▄
   ▄████▄        ██         ▄████▄    ▄████▄█████▀▄████▄ ██▄▄▄████▄ ▀█████▀
                                                                           
                                                                           """



HEADER_TITLE = """░▀█▀░█▒█░░▒█▀▄░█░▄▀▀░█▄▀░█▒░▒██▀
░▒█▒░▀▄▀▒░░█▀▒░█░▀▄▄░█▒█▒█▄▄░█▄▄"""


MODE_SELECT = """▄▀▀ ██▀ █   ██▀ ▄▀▀ ▀█▀   █▄ ▄█ ▄▀▄ █▀▄ ██▀
▄██ █▄▄ █▄▄ █▄▄ ▀▄▄  █    █ ▀ █ ▀▄▀ █▄▀ █▄▄"""

TV_MODE = """▀█▀ █ █   █▄ ▄█ ▄▀▄ █▀▄ ██▀
█  ▀▄▀   █ ▀ █ ▀▄▀ █▄▀ █▄▄"""

MOVIE_MODE = """█▄ ▄█ ▄▀▄ █ █ █ ██▀   █▄ ▄█ ▄▀▄ █▀▄ ██▀
█ ▀ █ ▀▄▀ ▀▄▀ █ █▄▄   █ ▀ █ ▀▄▀ █▄▀ █▄▄"""

ACTOR_MODE = """▄▀▄ ▄▀▀ ▀█▀ ▄▀▄ █▀▄   █▄ ▄█ ▄▀▄ █▀▄ ██▀
█▀█ ▀▄▄  █  ▀▄▀ █▀▄   █ ▀ █ ▀▄▀ █▄▀ █▄▄"""

MODE_LOOKUP = {'tv':TV_MODE, 'movie':MOVIE_MODE, 'actor':ACTOR_MODE}

QUERY_CONTROLS = 'Tab: Change /: Enter Text Query, '